%%变压器风险预测模型
% 设置输入：
A=xlsread('BYQstate');              %变压器状态信息。
x=A(1,1);                           %变压器整体健康状态评分值
t=B(2,1);                           %变压器运行年限
% 概率等级设置：
a1=0.03;                            %超过该值，变压器正常故障极少发生
a2=0.07;                            %超过该值，变压器正常故障偶尔发生
a3=0.12;                            %超过该值，变压器正常故障可能发生
a4=0.18;                            %超过该值，变压器正常故障很可能发生
% 风险后果等级：
b1=2.2;                             %超过该值，风险后果适中
b2=2.6;                             %超过该值，风险后果稍微严重
b3=3.0;                             %超过该值，风险后果严重
% 风险后果权重：
w1=0.1313;
w2=0.1863;
w3=0.0888;
w4=0.0888;
w5=0.2813;
w6=0.2234;
% 调用函数：
Pro=P_YY(x)+P_OR(t)                 %变压器总站概率  %变压器当前概率为诱因性故障概率与偶然故障概率值之和。当前只考虑变压器整体状态。
F_R=F_ZY(w1,w2)+F_HG(w3,w4,w5,w6)                   %变压器风险后果为重要性后果与损失性后果的加权。
% 判断等级：
if Pro>a4&F_R>b1                   %其中a0,a1,a2,a3,a4和b0,b1,b2,b3分别为故障概率等级和风险后果等级
    Res='A';
   elseif Pro>a4
       Res='B';
       elseif Pro>a3&F_R>b2
           Res='A';
           elseif Pro>a3&F_R>b1
               Res='B';
               elseif Pro>a3
                   Res='C';
                   elseif Pro>a2&F_R>b3
                       Res='A';
                       elseif Pro>a2&F_R>b2 
                           Res='B';
                           elseif Pro>a2&F_R>b1
                               Res='C';
                               elseif Pro>a2
                                   Res='D';
                                   elseif Pro>a1&F_R>b2 
                                       Res='B';
                                       elseif Pro>a1&F_R>b1 
                                           Res='C'; 
                                           elseif Pro>a1
                                               Res='D'; 
                                               elseif F_R>b3 
                                                   Res='B';
                                                   elseif F_R>b2 
                                                       Res='C';
                                                       else 
                                                          Res='D'; 
end
% 输出结果：
if Res=='A'
    fprint('风险等级：A')
    fprint('含义：高风险，应立刻采取行动')
%     input('风险来源分析：')
    elseif Res=='B'
        fprint('风险等级：B')
        fprint('含义：风险适中，应采取办法予以消除')    
%         input('风险来源分析：')
        elseif Res=='C'
            fprint('风险等级：C')
            fprint('含义：低风险，应采取办法予以减轻')    
%             input('风险来源分析：')
            else Res=='D'
                fprint('风险等级：D')
                fprint('含义：小风险，可接受')    
%                 input('风险来源分析：')
end
%%调用故障概率模型
%%%%1、诱因性故障概率
function y=P_YY(x)         %x为变压器状态评分值
k=8640;                    %函数参数，隐藏可调
c=0.15958;
if x<60
    x=60;
    y=0.33*k*exp(-100*c)*(exp(c*(100-x))-1);
elseif x<70
    y=(-0.0067*x*x+0.938*x-31.83)*k*exp(-100*c)*(exp(c*(100-x))-1);
else
    y=k*exp(-100*c)*(exp(c*(100-x))-1);
end
end

%%%%2、偶然性故障概率
function y=P_OR(t)           %此处t为变压器运行年限
k=4.5777;                    %函数参数，隐藏可调
c=28.287;                    
if t<=15
    y=0.0169;
else
    y=(k/c)*(t/c)^(k-1);
end
end

%%%%调用风险后果评估模型
function y=F_ZY(w1,w2)                  %w1,w2,w3,w4,w5,w6为不同风险后果的重要程度，默认值分别为0.1313，0.1863，0.0888，0.0888，0.2813，0.2234
    A=xlsread('BYQstate');              %变压器状态信息。
    V=A(3,1);                           %变压器容量
    b=A(4,1);                           %是否为常年保电主变标识
    I=A(4,1);                           %变压器高压侧电流
    y=w1*F1(V)+w2*F2(b,I);
end
%%%%1.1、资产价值
function y=F1(x)     %x为变压器容量，单位：MVA
if x>180
    F11=10;
elseif x>150
    F11=9;
elseif x>120
    F11=7;
elseif x>90
    F11=5; 
else
    F11=3;
end
y=F11;
end
%%%%1.2、设备等级
function y=F2(x,I)     %x为变压器设备标识，x=1时，指主变为常年保电设备，x=0时，主变为普通设备；I为变压器高压侧电流
I_C=1000;
if x==1
    F22=5+5*(I/I_C); 
else
    F22=5*(I/I_C);
end
y=F22;
end
function y=F_HG(w3,w4,w5,w6)  %w1,w2,w3,w4,w5,w6为不同风险后果的重要程度，默认值分别为0.1313，0.1863，0.0888，0.0888，0.2813，0.2234
%%%%2.1、资产损失
F3=0.125*3+0.083*6+0.00001*9;      % 变压器成本损失按照一般程度，中度程度，重度程度分别为12．5％，8．3％，0．O％。
%%%%2.2、环境损失
F4=0.083*3+0.028*6+0.00001*9;      % 变压器环境损失按照一般程度，中度程度，重度程度分别为8．3％，2．8％，O．O％。
%%%%2.3、人身安全
F5=0.001*1+0.0001*3+0.00001*6+0.000001*9; % 变压器人身安全损失按照重轻伤事故，一般人身事故，重大人身事故和特大人身事故分别为0.1％，0.01％，O．O01％和O．O001％。
%%%%2.4、电网安全
F6=0.028*4+0.001*6+0.0001*7+0.00001*10; % 变压器人身安全损失按照一级电网事故，二级电网事故，三级电网事故和四级电网事故分别为2.8％，0.1％，O．01％和O．O01％。
y=w3*F3+w4*F4+w5*F5+w6*F6;
end
%%%%风险等级预测，展示风险等级中所处的位置。